{"mnleg_chatter":[{"index":6,"chatter":"The House has swung back and forth like a metronome in recent years, with the DFL winning in presidential years when more of the party's voters turn out, and the GOP winning in the off years. Although good candidates and effective campaigns can help swing some votes, national dynamics -- including the parties' presidential candidates -- will also play a role in which party has the upper hand.","headline":"The coattail effect"},{"index":0,"chatter":"The parties have become deeply divided along geographic lines, with Republicans dominating rural and exurban areas, while the DFL controls the Twin Cities, and a few other cities like Duluth. The battle for the House will come down to a handful of suburban districts, as well as regional centers like Willmar, Faribault, St. Cloud, Albert Lea and Red Wing.","headline":"Outstate vs. metro"},{"index":1,"chatter":"The Star Tribune analyzed data for all 134 House districts stretching back six elections and rated how each one has leaned politically in recent years. In 2014, Republicans won a handful of seats by small margins in districts traditionally more often controlled by the DFL, whereas DFLers took few districts where the GOP has usually fared better.","headline":"Rating each district"},{"index":2,"chatter":"The GOP swung 11 seats in 2014 plus another in a special election earlier this year, giving them more battleground seats to defend. But Republicans have aggressively recruited candidates to challenge some longtime DFL incumbents like Reps. Paul Marquart and Tom Anzelc, forcing the DFL to defend incumbents in some GOP-friendly areas.","headline":"A big GOP margin"},{"index":3,"chatter":"A number of districts have swapped hands multiple times and are considered competitive races in 2016. Seats that have historically leaned to one party but are currently held by other are also races to watch.","headline":"Races to watch"},{"index":4,"chatter":"Retirements have created open seats, including in some battleground districts in the suburbs like Apple Valley and Minnetonka, as well as regional centers like Bemidji and Red Wing. The DFL has 11 open seats to defend while the GOP has seven.","headline":"Retirements and vacancies"},{"index":5,"chatter":"Many of this year's key races are sequels to 2014, as the DFL persuaded several of its vanquished lawmakers to come back and run again in 2016, including Zachary Dorholt in St. Cloud, Patti Fritz in Faribault and Mary Sawatzky in Willmar.","headline":"Rerunning some races"},{"index":7,"chatter":"","headline":"Campaign finance"},{"index":8,"chatter":"The DFL has controlled the Senate for 42 of the past 44 years, with the GOP controlling the chamber for just one term after the Republican wave election of 2010. A highly focused effort to retake the majority combined with the coattails of President's Obama's re-election helped the DFL take control of the Senate again in 2012.","headline":"DFL dominance"},{"index":9,"chatter":"The DFL won everywhere and often by large margins. This gives the GOP confidence that their incumbents are safe, because if they survived 2012, surely they can survive this year. With safe incumbents, Republicans can dump resources into DFL districts they hope to flip.","headline":"A big DFL margin"},{"index":10,"chatter":"Increasingly in Minnesota politics -- mirroring a nationwide trend -- geography is destiny. The DFL controls the cities while rural areas go Republican. The two sides fight it out in the suburbs and in regional centers like Red Wing, St. Cloud, Faribault and Willmar.","headline":"Metro vs. outstate divisions"},{"index":11,"chatter":"The Star Tribune analyzed data for all 67 Senate districts going back four elections and rated how each one leans.","headline":"How the districts lean"},{"index":12,"chatter":"Republicans are eyeing six districts that GOP presidential nominee Mitt Romney won in 2012 but are currently held by DFL senators, plus three more DFL Senate districts that GOP gubernatorial nominee Jeff Johnson won in 2014. If the GOP can flip six of those, they will claim the majority. Not so fast, says the DFL. They are looking at vulnerable GOP incumbents in the metro suburbs, and especially GOP Minority Leader David Hann in Eden Prairie.","headline":"Races to watch"},{"index":13,"chatter":"Retirements have created open seats. The DFL has nine open seats to defend, while the GOP has four.","headline":"Retirements and vacancies"},{"index":14,"chatter":"Some of this year's key races are sequels to 2012.","headline":"Rerunning some races"},{"index":15,"chatter":"","headline":"Campaign finance"}]}